; domain
(define (domain put_task)
 (:requirements :typing :adl)
 (:types
    agent - dummy
    receptacle - dummy
    object -dummy
    receptacle_object - receptacle
    receptacle_object - object
  )

 (:predicates
    (atLocation ?a - agent ?l - receptacle)
    (objectAtLocation ?o - object ?l - receptacle)
    (inReceptacle ?o - object ?r - receptacle)
    (isReceptacleObject ?o - object)
    (holds ?a - agent ?o - object)
    (holdsAny ?a - agent)
    (holdsAnyReceptacleObject ?a - agent)
    (isClean ?o - object)
    (cleanable ?o - object)
    (isHot ?o - object)
    (heatable ?o - object)
    (isCool ?o - object)
    (coolable ?o - object)
    (toggleable ?o - object)
    (isOn ?o - object)
    (isToggled ?o - object)
    (sliceable ?o - object)
    (isSliced ?o - object)
    (isSinkBasin ?r - receptacle)
    (isMicrowave ?r - receptacle)
    (isFridge ?r - receptacle)
    (isKnife ?o - object)
    (isCounterTop ?o - object)
 )

 (:action GotoLocation
    :parameters (?a - agent ?lStart - receptacle ?lEnd - receptacle)
    :precondition (and
            (atLocation ?a ?lStart)
            )
    :effect (and
                (atLocation ?a ?lEnd)
                (not (atLocation ?a ?lStart))
            )
 )



 (:action PickupObjectInReceptacle
    :parameters (?a - agent ?o - object ?r - receptacle)
    :precondition (and
            (atLocation ?a ?r)
            (objectAtLocation ?o ?r)
            (inReceptacle ?o ?r)
            (not (holdsAny ?a))
            )
    :effect (and
                (not (inReceptacle ?o ?r))
                (not (objectAtLocation ?o ?r))
                (holds ?a ?o)
                (holdsAny ?a)
            )
 )

 (:action PickupObjectNoReceptacle
    :parameters (?a - agent ?o - object ?r - receptacle)
    :precondition (and
            (atLocation ?a ?r)
            (objectAtLocation ?o ?r)
            (not (inReceptacle ?o ?r))
            (not (holdsAny ?a))
            )
    :effect (and
                (not (objectAtLocation ?o ?r))
                (holds ?a ?o)
                (holdsAny ?a)
            )
 )

 (:action PutObjectInReceptacle
    :parameters (?a - agent ?o - object ?r - receptacle)
    :precondition (and
            (atLocation ?a ?r)
            (holds ?a ?o)
            (not (holdsAnyReceptacleObject ?a))
            )
    :effect (and
                (inReceptacle ?o ?r)
                (not (holds ?a ?o))
                (not (holdsAny ?a))
                (objectAtLocation ?o ?r)
            )
 )

 (:action PutObjectInReceptacleObject
    :parameters (?a - agent ?o - object ?outerO ?outerR - receptacle)
    :precondition (and
            (atLocation ?a ?outerR)
            (objectAtLocation ?outerO ?outerR)
            (isReceptacleObject ?outerO)
            (not (isReceptacleObject ?o))
            (holds ?a ?o)
            (not (holdsAnyReceptacleObject ?a))
            (inReceptacle ?outerO ?outerR)
            )
    :effect (and
                (inReceptacle ?o ?outerO)
                (inReceptacle ?o ?outerR)
                (not (holds ?a ?o))
                (not (holdsAny ?a))
                (objectAtLocation ?o ?outerR)
            )
 )

 (:action PutReceptacleObjectInReceptacle
    :parameters (?a - agent ?outerO - object ?r - receptacle)
    :precondition (and
            (atLocation ?a ?r)
            (holds ?a ?outerO)
            (holdsAnyReceptacleObject ?a)
            (isReceptacleObject ?outerO)
            )
    :effect (and
                (forall (?obj - object)
                    (when (holds ?a ?obj)
                        (and
                            (not (holds ?a ?obj))
                            (objectAtLocation ?obj ?r)
                            (inReceptacle ?obj ?r)
                        )
                    )
                )
                (not (holdsAny ?a))
                (not (holdsAnyReceptacleObject ?a))
            )
 )

 (:action CleanObject
    :parameters (?a - agent ?o - object ?l - receptacle)
    :precondition (and
            (isSinkBasin ?l)
            (atLocation ?a ?l)
            (holds ?a ?o)
            )
    :effect (and
                (isClean ?o)
            )
 )

 (:action HeatObject
    :parameters (?a - agent ?o - object ?l - receptacle)
    :precondition (and
            (or
                (isMicrowave ?l)
            )
            (atLocation ?a ?l)
            (holds ?a ?o)
            )
    :effect (and
                (isHot ?o)
            )
 )

 (:action CoolObject
    :parameters (?a - agent ?o - object ?l - receptacle)
    :precondition (and
            (or
                (isFridge ?l)
            )
            (atLocation ?a ?l)
            (holds ?a ?o)
            )
    :effect (and
                (isCool ?o)
            )
 )

 (:action ToggleObject
    :parameters (?a - agent ?o - object ?l - receptacle)
    :precondition (and
            (atLocation ?a ?l)
            (objectAtLocation ?o ?l)
            (toggleable ?o)
            )
    :effect (and
                (when (isOn ?o)
                    (not (isOn ?o)))
                (when (not (isOn ?o))
                    (isOn ?o))
                (isToggled ?o)
            )
 )

 (:action SliceObject
    :parameters (?a - agent ?co - object ?ko - object ?l - receptacle)
    :precondition
            (and
                (isKnife ?ko)
                (atLocation ?a ?l)
                (objectAtLocation ?co ?l)
                (sliceable ?co)
                (holds ?a ?ko)
                (isCounterTop ?l)
            )
    :effect (and
                (isSliced ?co)
            )
 )
)

; problem
(define (problem put_Laptop1_on_the_Sofa2_Do_not_put_it_in_Box1_95)
  (:domain put_task)
  (:objects
agent1 - agent    Book2 - object
    Pillow1 - object
    CellPhone3 - object
    CD1 - object
    Laptop2 - object
    CellPhone1 - object
    Watch1 - object
    Book1 - object
    KeyChain1 - object
    Book3 - object
    CellPhone4 - object
    Pillow2 - object
    Laptop1 - object
    CellPhone2 - object
    Pencil1 - object
    Sofa2 - receptacle
    Sofa1 - receptacle
    Drawer3 - receptacle
    Bed3 - receptacle
    Sofa3 - receptacle
    Drawer1 - receptacle
    Drawer2 - receptacle
    Box3 - receptacle_object
    Desk2 - receptacle
    Bed4 - receptacle
    Bed1 - receptacle
    Desk1 - receptacle
    Bed2 - receptacle
    Box1 - receptacle_object
    Box2 - receptacle_object
    AlarmClock1 - object
    Box4 - receptacle_object
  )

  (:init
    (atLocation agent1 Bed1)
    (objectAtLocation Laptop1 Sofa1)
    (objectAtLocation Pillow1 Bed1)
    (objectAtLocation Book1 Bed2)
    (objectAtLocation Laptop2 Bed3)
    (objectAtLocation Watch1 Drawer1)
    (objectAtLocation CellPhone1 Sofa2)
    (objectAtLocation CellPhone2 Drawer2)
    (objectAtLocation Pillow2 Sofa3)
    (objectAtLocation KeyChain1 Drawer3)
    (objectAtLocation Book3 Desk1)
    (objectAtLocation CellPhone3 Desk2)
    (objectAtLocation CellPhone4 Bed4)
    (objectAtLocation AlarmClock1 Box4)
    (objectAtLocation Box4 Box1)
    (objectAtLocation Box1 Sofa2)
    (objectAtLocation Box2 Sofa2)
    (objectAtLocation Box3 Sofa3)
  )

  (:goal
    (and
      (objectAtLocation Laptop1 Sofa2)
      (objectAtLocation AlarmClock1 Sofa2)
      (not (objectAtLocation Laptop1 Box1))
      (not (objectAtLocation Laptop1 Box4))
      (not (objectAtLocation AlarmClock1 Box1))
      (not (objectAtLocation AlarmClock1 Box4))
    )
  )
)

; plan
1. (gotolocation agent1 bed1 box4)
   deleted: (atlocation agent1 bed1)
   added: (atlocation agent1 box4)
   goals met: 3 of 6
2. (pickupobjectnoreceptacle agent1 alarmclock1 box4)
   deleted: (objectatlocation alarmclock1 box4)
   added: (holds agent1 alarmclock1) (holdsany agent1)
   goals met: 4 of 6
3. (gotolocation agent1 box4 sofa2)
   deleted: (atlocation agent1 box4)
   added: (atlocation agent1 sofa2)
   goals met: 4 of 6
4. (putobjectinreceptacle agent1 alarmclock1 sofa2)
   deleted: (holds agent1 alarmclock1) (holdsany agent1)
   added: (inreceptacle alarmclock1 sofa2) (objectatlocation alarmclock1 sofa2)
   goals met: 5 of 6
5. (gotolocation agent1 sofa2 sofa1)
   deleted: (atlocation agent1 sofa2)
   added: (atlocation agent1 sofa1)
   goals met: 5 of 6
6. (pickupobjectnoreceptacle agent1 laptop1 sofa1)
   deleted: (objectatlocation laptop1 sofa1)
   added: (holds agent1 laptop1) (holdsany agent1)
   goals met: 5 of 6
7. (gotolocation agent1 sofa1 sofa2)
   deleted: (atlocation agent1 sofa1)
   added: (atlocation agent1 sofa2)
   goals met: 5 of 6
8. (putobjectinreceptacle agent1 laptop1 sofa2)
   deleted: (holds agent1 laptop1) (holdsany agent1)
   added: (inreceptacle laptop1 sofa2) (objectatlocation laptop1 sofa2)
   goals met: 6 of 6
